GHB2/src/InformationRegisters/гхб_ИсторияОбменовСБазамиХолдинга/гхб_ИсторияОбменовСБазамиХолдинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ИсторияОбменовСБазамиХолдинга</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.гхб_ДополнительныеУслугиДляНомеровТелефонов</types>
      <types>CatalogRef.гхб_НомераТелефонов</types>
      <types>CatalogRef.гхб_ЦеновыеПакетыМобильнойСвязи</types>
      <types>DocumentRef.гхб_ЛимитНаМобильнуюСвязь</types>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеСтрокаНеограниченнойДлины</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.гхб_ПользователиБазХолдинга</types>
      <types>CatalogRef.гхб_ДополнительныеУслугиДляНомеровТелефонов</types>
      <types>CatalogRef.гхб_ФизическиеЛицаБазХолдинга</types>
      <types>CatalogRef.гхб_НомераТелефонов</types>
      <types>CatalogRef.гхб_ЦеновыеПакетыМобильнойСвязи</types>
      <types>DocumentRef.гхб_ЛимитНаМобильнуюСвязь</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.гхб_ТипыОбменовДляБазХолдинга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Enums/гхб_ТипыОбменовДляБазХолдинга/гхб_ТипыОбменовДляБазХолдинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ТипыОбменовДляБазХолдинга</name>
  <enumValues>
    <name>БлокировкаПользователя</name>
  </enumValues>
  <enumValues>
    <name>ЗаписьКонтактнойИнформации</name>
  </enumValues>
  <enumValues>
    <name>МиграцияОбъекта</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Catalogs/гхб_БазыХолдинга/гхб_БазыХолдинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_БазыХолдинга</name>
  <attributes>
    <name>GUIDБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийИсточникПоУмолчанию</name>
    <type>
      <types>CatalogRef.гхб_ВнешниеИсточники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБазы</name>
    <type>
      <types>EnumRef.гхб_ТипыБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменПоМобильнойСвязи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетМобСвязиВРазрезеЛицевыхСчетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/CommonModules/гхб_МобильнаяСвязьСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняется миграция данного справочника в базу РИБ
// Сопоставление свойств для всех справочников через УИД
//
// Параметры:
//  СтрБазаХолдинга - Внешний источник по которому производится соединение и база холдинга
//  ИмяФункции - Строка. Название выполняемой функции в базе приемнике
//  СтруктураСвойств - Структура. Список свойств для обмена. Всегда присутствует УИДИзБазыГХБ2 и Ссылка
//
// Возвращаемое значение:
//   ОбменПрошел  - Булево. Признак, что обмен прошел удачно
//
Функция ОтправитьСправочникВБазуРИБ(СтрБазаХолдинга, ИмяФункции, СтруктураСвойств) Экспорт
	
	ОбменПрошел = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("УИДИзБазыГХБ2", Строка(СтруктураСвойств.Ссылка.УникальныйИдентификатор()));
	
	Для каждого СтрСвойства Из СтруктураСвойств.СтруктураСвойствКЗаполнению Цикл
		СтруктураПараметров.Вставить(СтрСвойства.Ключ, СтрСвойства.Значение);
	КонецЦикла; 
			
	ОтветСервиса = JsonRPC.ВыполнитьПроцедуруJsonRPC(СтрБазаХолдинга.ВнешнийИсточник, ИмяФункции, СтруктураПараметров);
														
	ТекстНеудачногоОбмена = НСтр("ru = 'Не удалось создать элемент справочника по причине: '; 
								 |uk = 'Не вдалося створити елемент довідника через: '");
	Если НЕ ОтветСервиса.ОбменПрошел Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстНеудачногоОбмена + ОтветСервиса.ТекстОшибки + ". База - " 
												+ СтрБазаХолдинга.БазаХолдинга);
	Иначе			
		
		Попытка
	
			УстановитьПривилегированныйРежим(Истина);
			
			СтруктураЗаписи = Новый Структура;
			СтруктураЗаписи.Вставить("Период", гхб_ОбщегоНазначенияСервер.ВернутьВремяНаСервере());
			СтруктураЗаписи.Вставить("БазаХолдинга", СтрБазаХолдинга.БазаХолдинга);
			СтруктураЗаписи.Вставить("Объект", СтруктураСвойств.Ссылка);
			СтруктураЗаписи.Вставить("Тип", Перечисления.гхб_ТипыОбменовДляБазХолдинга.МиграцияОбъекта);
			СтруктураЗаписи.Вставить("Значение", СтруктураСвойств.Ссылка);           
			СтруктураЗаписи.Вставить("Пользователь", Пользователи.ТекущийПользователь());
			
			РегистрыСведений.гхб_ИсторияОбменовСБазамиХолдинга.ЗаписатьСтрокуВРегистр(СтруктураЗаписи);
			
			УстановитьПривилегированныйРежим(Ложь);
			
			ТекстСообщения = НСтр("ru = 'Обмен прошел удачно!'; uk = 'Обмін пройшов вдало!'")
								+ " База - " + СтрБазаХолдинга.БазаХолдинга;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ОбменПрошел = Истина;
			
		Исключение
			
			ТекстСообщения = НСтр("ru = 'Не удалось записать данные в регистр миграции данных!'; 
			         		  	  |uk = 'Не вдалося записати дані в регістр міграції даних!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецПопытки;	
				
	КонецЕсли;	
	
	Возврат ОбменПрошел;

КонецФункции

// Выполняется миграция данного справочника во все базы РИБ, где идет учет по мобильной связи
// Если обмен не прошел по хотя бы одной из баз, то считатся, что весь обмен не прошел
// Процедура отката изменений для баз у которых прошел обмен, но в целом обмен не прошел пока не придусмотрена
//
// Параметры:
//  ИмяФункции - Строка. Название выполняемой функции в базе приемнике
//  СтруктураСвойств - Структура. Список свойств для обмена. Всегда присутствует УИДИзБазыГХБ2 и Ссылка
//
// Возвращаемое значение:
//   ОбменПрошел  - Булево. Признак, что обмен прошел удачно
//
Функция ОтправитьСправочникВБазыРИБ(ИмяФункции, СтруктураСвойств) Экспорт
	
	ОбменПрошел = Истина;
	
	ТЗВнешнихИсточников = ВернутьСписокВнешнихИсточниковПоМобильнойСвязи();
	Для каждого СтрБазаХолдинга Из ТЗВнешнихИсточников Цикл
	
		Если НЕ ОтправитьСправочникВБазуРИБ(СтрБазаХолдинга, ИмяФункции, СтруктураСвойств) Тогда
			ОбменПрошел = Ложь;	
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ОбменПрошел;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВернутьСписокВнешнихИсточниковПоМобильнойСвязи()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гхб_БазыХолдинга.Ссылка КАК БазаХолдинга,
		|	гхб_БазыХолдинга.ВнешнийИсточникПоУмолчанию КАК ВнешнийИсточник
		|ИЗ
		|	Справочник.гхб_БазыХолдинга КАК гхб_БазыХолдинга
		|ГДЕ
		|	гхб_БазыХолдинга.ОбменПоМобильнойСвязи";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();	

КонецФункции

#КонецОбласти
